{"Krama/Krama":{"title":"Krama","links":[],"tags":[],"content":"]■[ “Krama System.” ]■[\n⎯ The Krama system does not recognize the ways of either the Pratyabhijna or the Kula system. In the Krama system, you must rise in succession, step by step. This system teaches that step-by-step realization makes your realization firm. As the Krama system is concerned with successive realization, it is primarily concerned with space and time, because where there is succession there you find the existence of space and time. In both the Pratyabhijna and Kula systems you are beyond space and time. In the Krama system, it is in the end, not in its process, that you are beyond time and space because it also carries you to that timeless and space-less state.\n“The Krama system is primarily attributed to shaktopaya and to the twelve Kalis.”\nThe twelve Kalis are said to be the twelve movements of any one cognition. For example, if you look at any object such as a pot, the sensation travels from your thought to the place of the pot, and then returns again from the place of the pot to your thought, giving you the sensation whereby you realize this pot. You do not realize this pot at the place of the pot, you realize this pot in your mind. Your perception has moved from inside to the pot, and then returned again from the pot to your thought. And these movements are distributed in twelve ways as the twelve Kalis in the Krama system.\nThe rise of prana kundalini is also described in the Krama system, because in prana kundalini you rise from one cakra to another, from one state to another state. As this is a successive process it is found in the Krama system.\nAlthough the Krama system existed in the beginning of kali-yuga, having been introduced by the sage Durvasa, it was reintroduced at the end of the 7th century A.D. in Kashmir by the sage Erakanatha,\nwho was also known as Shivanandanatha. Shivanandanatha had only three chief disciples which he initiated into the Krama system. Because in this system predominance is given only to shakti, all three were females. Their names were Keyuravati, Madanika, and Kalyanika. They were quite prominent and were completely informed in the Krama system. Afterwards, these ladies also initiated disciples, which were both male and female."},"Kula/Kula":{"title":"Kula","links":[],"tags":[],"content":"]■[ “Kula System.” ]■[\n⎯ The Kula system teaches you how you can live in caitanya  (universal Consciousness), the real nature of yourself, in the act of ascending and descending. While you rise from the lowest to the highest you realize your nature, and while you descend from the highest to the lowest you also realize your nature.\n“In the Kula system, there is no break in the realization of your own nature either in the highest or in the lowest cycle. This system, therefore, teaches you how you can live in totality.”\nIn fact, the word kula means “totality.”\nIn the practice of the Kula system, you have to realize the totality of the universe in one particle. Take one particle of anything that exists in this world; in that one particle is to be realized the totality of the whole universe. The totality of energy is found in one particle. Everything is full of one thing and one thing is full of all things.\nThe difference between the Pratyabhijna system and the Kula system is, that the Pratyabhijna system teaches you how to realize your own nature in one place and exist there, reside there. While the Kula system teaches you how you can rise from the lowest degree to the highest degree, and all the while, experience the nature of your Self on the same level and state. Shiva, which is realized in prithvi tattva (earth element), is the same level, the same reality of Shiva which is realized in Shiva tattva. Here, there is complete realization in every act of the world.\nThe Kula system was introduced in Kashmir in the beginning of the 5th century A.D. by Shri Macchandanatha. Later, in the 9th century, because its teachings had become distorted, it was reintroduced by Sumatinatha. In the line of masters that followed from Sumatinatha, Somanatha was his disciple. Shambhunatha was the disciple of Somanatha, and the great Abhinavagupta was the disciple of Shambhunatha."},"Pratyabhijna/Pratyabhijñā":{"title":"Pratyabhijñā","links":[],"tags":[],"content":"]■[ “Pratyabhijna System.” ]■[\n⎯ The word pratyabhijna means “to spontaneously once again recognize and realize your Self.” Here you have only to realize, you do not have to practice. There are no upayas (means) in the Pratyabhijna system. You must simply recognize who you are. Wherever you are, whether you are at the level of Supreme Being, at the level of yoga, or at that level which is disgusting, you can recognize your own Nature then and there without moving anywhere or doing anything.\nFor example, take the case of a bride and groom. The woman has not seen her husband-to-be and craves to see him. Concerning him she has only heard praise and glory but she has not actually met him. Suppose this girl and her future husband happen by chance to go separately on the same pilgrimage. When they arrive at the place of pilgrimage, they meet. The girl, however, does not feel any importance in this man because she does not know him to be her future husband. Yet her future husband and this man are the same person. Later, when a friend introduces her to him, telling her that this is the man who is to be her husband, then she is filled with happiness, pleasure, and ecstasy. She realizes that this is the same man she had seen before.\nIn the same way, reality dawns in the Pratyabhijna system. In whichever level you are situated, do not mind.\n“The moment recognition dawns, not only do you instantaneously become divine, but you also realize that you were already divine.”\nAt that moment, you realize that you were already the Lord but did not know it because you had misunderstood yourself.\nIn the Pratyabhijna philosophy it is your master who tells you, that ‘you are the same person for whom you are longing’, and he teaches you to reach the goal there and then without adopting any means. This teaching, therefore, is situated chiefly in anupaya, which is that means where there are no means at all. It is the recognition that there was nothing to be done and nowhere to go. Here, there is no practice, no concentration and no meditation. By the grace  of your master you realize it and you are there.\nThe Pratyabhijna system was flourishing in the beginning of kali-yuga. As time passed, however, it became veiled due to misunderstanding. It wasn’t until the end of the eighth century A.D. that the great master Somananda reintroduced the Pratyabhijna system in Kashmir. Somananda’s disciple was Utpaladeva, and his disciple was Lakshmanagupta, and his disciple was the very great Abhinavagupta."},"Spanda/Spanda":{"title":"Spanda","links":[],"tags":[],"content":"]■[ “Spanda System.” ]■[\n⎯ The fourth system, which comprises the Trika philosophy, is called the Spanda system. The word spanda means “movement.”\n“The Spanda school recognizes that nothing can exist without movement. Where there is movement there is life, and where there is no movement that is lifelessness.”\nThey realize that there is movement in wakefulness, dreaming, deep sleep, and turya [void]. Though some thinkers argue that there is no movement in deep sleep the philosophers of the Spanda system realize that nothing can exist without movement.\nThe teachings of the Spanda system, which is an important practical system, are found embodied in the “Vijnana Bhairava Tantra,” the “Svacchanda Tantra,” and in the 6th chapter of the “Tantraloka.”\nThe Spanda System was introduced in Kashmir by the great sage Vasuguptanatha at the beginning of the 8th century A.D. Vasuguptanatha is the author of both the “Shiva Sutras” and the “Spanda Karikas.” The disciple of Vasuguptanatha was Kallata.\nSome teachers think that the “Spanda Karikas” were not composed by Vasuguptanatha but rather by his disciple Kallata. This theory, however, is absolutely incorrect."},"ganapati":{"title":"ganapati","links":[],"tags":["ganpati","mantra"],"content":"Shri Ganesh\nअसूरसूरवृन्दवन्दितमभिमतवरवितरणे निरतम्।\nदर्शनशताग्र्यपूज्यं प्राणतनुं गणपतिं वन्दे॥\nmy first adoration to the lotus-feets of GAṆAPATI; the master of śiva’s servants; who is the representation of breath-outgoing and dedicated to fulfillment of the most highest wishes and worshipped by the assembly of devā-s and asurā-s; also the most and first among all the darśana-s to be worshipped above anybody.\n— mahāmaheśvara abhinavaguptaḥ."},"index":{"title":"•~• Welcome Note •~•","links":["Pratyabhijna/Pratyabhijñā","Kula/Kula","Krama/Krama","Spanda/Spanda"],"tags":[],"content":"\nkarpurgauram\nA secret layer of Non-dual Trīka Śaivadharma, heavily rooted and influenced by Non-dual Bhairava Āgama-s, Aesthetics and the Pratyabhijñā, Spanda, Krama and Kula together known as Trika philosophy of Gurudeva Mahāmaheśvara Abhinavagupta.\nWe embrace all genres of dark and light introspective Tāntrik insights and wisdom.\nThis place is best described as Esoteric Revival mixed with deep introspective of the hidden secrets of the Non-dual Bhairava Āgamas and their esoteric teachings.\n\nUnderstanding this Trīka philosophy and choice are what defines one’s own Self.\nEsoteric Trīka Mārga/path encourages Self discovery above all else.\n\nWe are deeply devoted to Trika philosophical insights with common interests often including:\n\nLinguistic Sanskṛt poems;\nBrutal Non-dual Bhairvāgamic Siddhānta-s;\nScience of Tantrāloka;\nLaw of Thoughtlessness;\nYoga of Śiva Sutras;\n112 VBT Dhāranā-s;\nDharma;\nMā Kāli;\nFrom Darkness to Light;\nDevotion;\nSādhanā;\nSamādhi\nMetaphysics;\nEsoteric Planes of Existence;\nand Mystikism.\n\nfeel free to explore\n\nPratyabhijñā System\nKula System\nKrama System\nSpanda System\nand more\n"},"test":{"title":"test","links":["first-page","second-page","third-page","ganapati","tags/introduction"],"tags":["introduction"],"content":"First heading\nThis is a sample document.\nIndex.md is a first page which is our homepage.\n\n\n                  \n                  INFO\n                  \n                \n\nPress Ctrl + - to zoom out and see full site\n\n\nWe can add other things at later\nthats second heading with two hashes\nThen, in your terminal of choice, enter the following commands line by line:\necho &quot;Welcome to Tantra loka&quot;\nthis is how you add code\nThis could be our index or so\nthis is how we link another pages no matter where they located at but they should have accurate file name\n[[first page]]\n[[second page]]\n[[third page]]\n\n\nfirst page\nsecond page\nthird page\n\nganapati\nThis is how we add external link\nVideo Link\n[Video Link](www.youtube.com/watch)\n\nalso images can be added via adding full url of it like above or uploading image file in some folder and giving path like this\n![image alt text](/images/shiva.jpg)\n\n\nlists\n\nfirst thing\nsecond thing\nthird thing\n\nhasttags\nHashtags works like wonders here.\nThey can be use to categories various pages.\nlike thisintroduction\nnow this page will be listed under introduction tag\nMore info and configuration can be found in here\nquartz.jzhao.xyz/"}}