{"Krama/Krama":{"title":"Krama","links":[],"tags":[],"content":"]■[ “Krama System.” ]■[\n⎯ The Krama system does not recognize the ways of either the Pratyabhijna or the Kula system. In the Krama system, you must rise in succession, step by step. This system teaches that step-by-step realization makes your realization firm. As the Krama system is concerned with successive realization, it is primarily concerned with space and time, because where there is succession there you find the existence of space and time. In both the Pratyabhijna and Kula systems you are beyond space and time. In the Krama system, it is in the end, not in its process, that you are beyond time and space because it also carries you to that timeless and space-less state.\n“The Krama system is primarily attributed to shaktopaya and to the twelve Kalis.”\nThe twelve Kalis are said to be the twelve movements of any one cognition. For example, if you look at any object such as a pot, the sensation travels from your thought to the place of the pot, and then returns again from the place of the pot to your thought, giving you the sensation whereby you realize this pot. You do not realize this pot at the place of the pot, you realize this pot in your mind. Your perception has moved from inside to the pot, and then returned again from the pot to your thought. And these movements are distributed in twelve ways as the twelve Kalis in the Krama system.\nThe rise of prana kundalini is also described in the Krama system, because in prana kundalini you rise from one cakra to another, from one state to another state. As this is a successive process it is found in the Krama system.\nAlthough the Krama system existed in the beginning of kali-yuga, having been introduced by the sage Durvasa, it was reintroduced at the end of the 7th century A.D. in Kashmir by the sage Erakanatha,\nwho was also known as Shivanandanatha. Shivanandanatha had only three chief disciples which he initiated into the Krama system. Because in this system predominance is given only to shakti, all three were females. Their names were Keyuravati, Madanika, and Kalyanika. They were quite prominent and were completely informed in the Krama system. Afterwards, these ladies also initiated disciples, which were both male and female."},"Kula/Kula":{"title":"Kula","links":[],"tags":[],"content":"]■[ “Kula System.” ]■[\n⎯ The Kula system teaches you how you can live in caitanya  (universal Consciousness), the real nature of yourself, in the act of ascending and descending. While you rise from the lowest to the highest you realize your nature, and while you descend from the highest to the lowest you also realize your nature.\n“In the Kula system, there is no break in the realization of your own nature either in the highest or in the lowest cycle. This system, therefore, teaches you how you can live in totality.”\nIn fact, the word kula means “totality.”\nIn the practice of the Kula system, you have to realize the totality of the universe in one particle. Take one particle of anything that exists in this world; in that one particle is to be realized the totality of the whole universe. The totality of energy is found in one particle. Everything is full of one thing and one thing is full of all things.\nThe difference between the Pratyabhijna system and the Kula system is, that the Pratyabhijna system teaches you how to realize your own nature in one place and exist there, reside there. While the Kula system teaches you how you can rise from the lowest degree to the highest degree, and all the while, experience the nature of your Self on the same level and state. Shiva, which is realized in prithvi tattva (earth element), is the same level, the same reality of Shiva which is realized in Shiva tattva. Here, there is complete realization in every act of the world.\nThe Kula system was introduced in Kashmir in the beginning of the 5th century A.D. by Shri Macchandanatha. Later, in the 9th century, because its teachings had become distorted, it was reintroduced by Sumatinatha. In the line of masters that followed from Sumatinatha, Somanatha was his disciple. Shambhunatha was the disciple of Somanatha, and the great Abhinavagupta was the disciple of Shambhunatha."},"Pratyabhijna/Pratyabhijñā":{"title":"Pratyabhijñā","links":[],"tags":[],"content":"]■[ “Pratyabhijna System.” ]■[\n⎯ The word pratyabhijna means “to spontaneously once again recognize and realize your Self.” Here you have only to realize, you do not have to practice. There are no upayas (means) in the Pratyabhijna system. You must simply recognize who you are. Wherever you are, whether you are at the level of Supreme Being, at the level of yoga, or at that level which is disgusting, you can recognize your own Nature then and there without moving anywhere or doing anything.\nFor example, take the case of a bride and groom. The woman has not seen her husband-to-be and craves to see him. Concerning him she has only heard praise and glory but she has not actually met him. Suppose this girl and her future husband happen by chance to go separately on the same pilgrimage. When they arrive at the place of pilgrimage, they meet. The girl, however, does not feel any importance in this man because she does not know him to be her future husband. Yet her future husband and this man are the same person. Later, when a friend introduces her to him, telling her that this is the man who is to be her husband, then she is filled with happiness, pleasure, and ecstasy. She realizes that this is the same man she had seen before.\nIn the same way, reality dawns in the Pratyabhijna system. In whichever level you are situated, do not mind.\n“The moment recognition dawns, not only do you instantaneously become divine, but you also realize that you were already divine.”\nAt that moment, you realize that you were already the Lord but did not know it because you had misunderstood yourself.\nIn the Pratyabhijna philosophy it is your master who tells you, that ‘you are the same person for whom you are longing’, and he teaches you to reach the goal there and then without adopting any means. This teaching, therefore, is situated chiefly in anupaya, which is that means where there are no means at all. It is the recognition that there was nothing to be done and nowhere to go. Here, there is no practice, no concentration and no meditation. By the grace  of your master you realize it and you are there.\nThe Pratyabhijna system was flourishing in the beginning of kali-yuga. As time passed, however, it became veiled due to misunderstanding. It wasn’t until the end of the eighth century A.D. that the great master Somananda reintroduced the Pratyabhijna system in Kashmir. Somananda’s disciple was Utpaladeva, and his disciple was Lakshmanagupta, and his disciple was the very great Abhinavagupta."},"Spanda/Spanda":{"title":"Spanda","links":[],"tags":[],"content":"]■[ “Spanda System.” ]■[\n⎯ The fourth system, which comprises the Trika philosophy, is called the Spanda system. The word spanda means “movement.”\n“The Spanda school recognizes that nothing can exist without movement. Where there is movement there is life, and where there is no movement that is lifelessness.”\nThey realize that there is movement in wakefulness, dreaming, deep sleep, and turya [void]. Though some thinkers argue that there is no movement in deep sleep the philosophers of the Spanda system realize that nothing can exist without movement.\nThe teachings of the Spanda system, which is an important practical system, are found embodied in the “Vijnana Bhairava Tantra,” the “Svacchanda Tantra,” and in the 6th chapter of the “Tantraloka.”\nThe Spanda System was introduced in Kashmir by the great sage Vasuguptanatha at the beginning of the 8th century A.D. Vasuguptanatha is the author of both the “Shiva Sutras” and the “Spanda Karikas.” The disciple of Vasuguptanatha was Kallata.\nSome teachers think that the “Spanda Karikas” were not composed by Vasuguptanatha but rather by his disciple Kallata. This theory, however, is absolutely incorrect."},"The-Birth-of-the-Tantras-in-Kashmir-Shaivism-and-My-Lineage":{"title":"The Birth of the Tantras in Kashmir Shaivism and My Lineage","links":[],"tags":[],"content":" Bhairava and Bhairavi (At the down of Satyayuga)\nThe Beginning:\nIn the beginning of Satyuga Lord Śiva appeared in the form of Svacchandanātha. As Svacchandanātha, He appeared with five heads and eighteen arms. His five heads came into manifestation through his five great energies: cit śakti, all consciousness; ānanda śakti, all bliss; icchā śakti, all will; jñāna śakti, all knowledge; and kriyā śakti, all action. And these five energies, which appeared in His five mouths and which are known as īśāna, tatpuruṣa, aghora, vāmadeva and sadyojāta, because of the grace (anugrahaḥ) of Lord Śiva, experienced the sensation of illuminating the Universe.\n\nSvacchandanātha\nLord Śiva wanted to enlighten the universe by manifesting the existence of the Tantras. In order to accomplish this, He manifested these Tantras through his five mouths. Initially, each of these mouths—**īśāna, tatpuruṣa, aghora, vāmadeva and sadyojāta—**created one Tantra. Then two mouths joined together and created one Tantra from each combination of two mouths. And then three mouths joined together and created one Tantra from each combination of three mouths. And then four mouths joined together, and then five mouths, and these combinations of mouths produced all of the Tantras of our Śaivism.\nThese Tantras are manifested in three ways. Initially, ten Tantras came into existence which were dualistic (bheda) and are called Śiva Tantras. These Tantras, which are not connected with Kashmir Śaivism, are filled with dualism. Then eighteen Tantras came into existence, which were filled with that thought which is monism cum dualism (bhedābheda). These Tantras are called Rudra Tantras. And finally, these five mouths came into existence in such a way that each and every mouth was simultaneously filled with the other four mouths. Here, four of the five energies were inserted into the fifth energy in such a way that it became full with all five energies. No one energy was in predominance, all were equal. And this happened to each and every energy. Simultaneously, from these mouths came the Bhairava Tantras, which are filled with only monistic thought (abheda). These Bhairava Tantras, which are the Tantras connected with Kashmir Śaivism, are sixty-four in number.\n\nParābhairava &amp; Bhairavi (The Beginning of Satyayug)\nIn the Bhairava Tantras, Lord Śiva is shown to be in predominance everywhere. He is there in fullness in Śiva and in all of His energies. He is equally present in everything and everywhere. You cannot say that something is closer to Him and something else is farther away. In everything He is there, fully and completely.\nInitially, this monistic Tantra, in the form of one Supreme Consciousness and Bliss, was not manifested in will, imagination, or words; rather, it was felt and observed by Lord Śiva Himself at the start of the illuminating energy. At this point, the manifestation of this Tantra resided in Lord Śiva’s innermost speech, known as Parāvāk (supreme speech). In this supreme speech of Lord Śiva, the creation of vācya and vācaka, master and disciple, was not yet felt as being differentiated. They resided in His own Being as undifferentiated. In the next movement of illuminating energy, the manifestation of the Tantras was held in his second speech, paśyantī. At this stage also, these Tantras were still undifferentiated and were one with His Supreme Will. In the next movement of illuminating energy, these Tantras were held in His third speech, madhyamā vāk. Here, they became differentiated and were manifested internally only in thought not in words. And in the final movement of illuminating energy, these Tantras were held in His fourth speech, vaikharī vāk, where they came out through His five mouths in differentiation as words, sentences, and verses.\nIn the three yugas (ages), satyuga, tretāyuga, and dvāparayuga, masters and disciples were initiated verbally, not in writing, requiring words and sentences. The power of memory in them was so great that they remembered everything instantaneously. There was no need for them to write anything down or to refer to books and papers. The masters and disciples were very great during these three yugas.\nWhen kaliyuga occurred, these masters and disciples were so disappointed that they hid themselves in unknown places in order to avoid the touch of worldly people living at that time. Because of this, the theory of the Bhairava Tantras and Kashmir Śaivism was lost. Lord Śiva, however, always wishes to illuminate the universe and so He reappeared in this world at Mount Kailāśa, not in the form of Svacchandanātha with five mouths, but in the form of Śrīkaṇṭhanātha. And in the form of Śrīkaṇṭhanātha, He again taught the theory of the Bhairava Tantras to the sage Durvāsā Ṛṣi, who was ūrdhvaretaḥ, which means “one whose power of sex is preserved,” and who was, therefore, a brahmacārī (celibate). When Śrīkaṇṭhanātha initiated him at Mount Kailāśa, Śrīkaṇṭhanātha told him that he was to expand the thought of Bhairava Tantras in all of the universe without restriction to caste, color, or creed. After Śrīkaṇṭhanātha taught Durvāsā Ṛṣi in this manner, he disappeared into the ether.\nŚiva Pārvatī Pariwār (Art: Unknown)\nDurvāsā Ṛṣi, after meditating completely to acquire a real and fit disciple for initiation, became disappointed. He could not find anyone in this world fit to be initiated. His initiation was a practical initiation because, while initiating someone in the thought of Bhairava Tantras, he simultaneously initiated him in the practical side of this thought. And this practical initiation manifested itself immediately without the disciples having to do any practice or yoga. This disciple would become instantaneously enlightened. As he could not find a disciple fit for this initiation, he created out of his mental power one mind-born son. This mind-born son was called Tryambakanātha. Durvāsā Ṛṣi completely initiated Tryambakanātha in the way of the monistic Bhairava Tantras. Afterwards, he created two more mind-born sons, Āmardakanātha and Śrīnātha. He initiated his son Āmardakanātha in the dualistic Śiva Tantras and he initiated his other son Śrinātha in the monodualistic Rudra Tantras. All of this was done by Durvāsā Ṛṣi for the upliftment of mankind.\nA painting depicting Durvasa\nFor the upliftment of women, Durvāsā Ṛṣi created one mind-born daughter and she was called Ardhatryambakā. As Kashmir Śaivism does not recognize women to be in a state of degradation, Durvāsā Ṛṣi initiated her completely in the monistic thought of Bhairava Tantras. As this view, that women are not in a state of degradation, is not held by the other two schools of Śaivism, the dualistic and monodualistic schools, Durvāsā Ṛṣi created only one-mind born daughter. His daughter Ardhatryambakā’s teaching is known as the Ardhatryambaka school of the Bhairava Tantras. But as the continuity of the Ardhatryambaka school manifested itself from one woman to another secretly, there is no history of this school in this kaliyuga.\nDurvāsā Ṛṣi’s son Tryambakanātha, the founder of the monistic school of Śaivism, was also a celibate (brahmacārī). According to the way of the sage Durvāsā Ṛṣi, he also created one mind-born son and named him Tryambakāditya, which means “the expansion of Tryambakanātha.” After initiating him completely in Bhairava Tantras, Tryambakanātha entered a cave, which is known as Tryambaka Guhā (cave), and disappeared. Tryambakanātha’s son Tryambakāditya also created one mind-born son and, after initiating him, Tryambakāditya disappeared into the ether.\nPancamukhī Śiva Pārvatī &amp; Nandi alongside Ṛṣabha bull (Art: Unknown)\nIn this manner fifteen siddhas were created by mind. When, however, the fifteenth siddha attempted to create a mind-born son, he was not successful. It is said that this fifteenth siddha was not fully introverted, but at the same time he was also given to worldly pleasures. Because of this subtle impurity (āṇava mala), he was not successful in creating a mind-born son. After sitting in long meditation, he found in this world a girl with all good qualities and he went to her father and made arrangements to marry her. After marriage, they created one son who was called Saṁgamāditya and who, by his will, came to the valley of Kashmir and found Kailāśa mountain. Saṁgamāditya, like his father, married and produced one son named Varṣāditya, whom he initiated completely in the thought of the monistic Bhairava Tantras. Varṣāditya also married and produced one son, named Aruṇāditya, whom he initiated fully. Aruṇāditya married and created one son named Ānanda, whom he initiated and who was also completely informed practically in Śaivism.\nThis sage Ānanda was the father of Somānandanātha, the originator of the Pratyabhijñā School of Śaivism and the author of the “Śiva Dṛṣṭi.” Up to the time of Somānandanātha, the initiation into the monistic thought of Bhairava Tantras took place from father to son. From Somānandanātha on, this initiation took place from master to disciple. Somānandanātha was the master of Utpaladeva. Utpaladeva was the master of Lakṣmaṇagupta. And Lakṣmaṇagupta was a master of our great Abhinavagupta, who was in the line of Atrigupta.\nNow I will explain to you how this Atrigupta, a great scholar of Kashmir Śaivism, came from India to live in the Kashmir Valley.\nDuring his reign, the king Lalitāditya traveled to India from Kashmir, where in Antarvedi, a tract of land in Madhya Pradesh which lies between the Yamuna and Ganga rivers, he discovered this great Śaiva teacher Atrigupta. Lalitāditya was deeply impressed by the scholarship and practical way of Atrigupta and requested him to accompany him to the Kashmir Valley. Atrigupta agreed and upon reaching Kashmir, was given the old palace of Pravarasena to live in because it was very near to the palace of the king Lalitāditya. After he moved to Kashmir, there was no authority on Kashmir Śaivism left in India. From this time forward, the teaching of the thought of Bhairava Tantras is called Kashmir Śaivism and this teaching has continued to remain centered only in the Kashmir Valley. These Bhairava Tantras are pervasive throughout the whole world.\nHowever, they began in the Kashmir Valley, resided there, and are still alive there today. After some centuries in the house of Atrigupta, Varāhagupta was born. He is the father of Narasiṁhagupta and Narasiṁhagupta is the father of our great Abhinavagupta. Although Abhinavagupta had many disciples, both men and women, his chief disciple was Kṣemarāja and the chief disciple of Kṣemarāja was Yogarāja. After many centuries in the Kashmir Valley, Svāmī Ram came into this physical body. His chief disciple was Svāmī Mahatābakak and my Guru Swāmi Lakṣamaṇa Jū Mahārāj is the disciple of Svāmī Mahatābakak and I am disciple of Swāmi Lakṣamaṇa Jū Mahārāj.\n\nSwāmi Lakṣamaṇa Jū Mahārāj"},"ganapati":{"title":"ganapati","links":[],"tags":["ganpati","mantra"],"content":"Shri Ganesh\nअसूरसूरवृन्दवन्दितमभिमतवरवितरणे निरतम्।\nदर्शनशताग्र्यपूज्यं प्राणतनुं गणपतिं वन्दे॥\nmy first adoration to the lotus-feets of GAṆAPATI; the master of śiva’s servants; who is the representation of breath-outgoing and dedicated to fulfillment of the most highest wishes and worshipped by the assembly of devā-s and asurā-s; also the most and first among all the darśana-s to be worshipped above anybody.\n— mahāmaheśvara abhinavaguptaḥ."},"index":{"title":"•~• Welcome Note •~•","links":["Pratyabhijna/Pratyabhijñā","Kula/Kula","Krama/Krama","Spanda/Spanda"],"tags":[],"content":"\nkarpurgauram\nA secret layer of Non-dual Trīka Śaivadharma, heavily rooted and influenced by Non-dual Bhairava Āgama-s, Aesthetics and the Pratyabhijñā, Spanda, Krama and Kula together known as Trika philosophy of Gurudeva Mahāmaheśvara Abhinavagupta.\nWe embrace all genres of dark and light introspective Tāntrik insights and wisdom.\nThis place is best described as Esoteric Revival mixed with deep introspective of the hidden secrets of the Non-dual Bhairava Āgamas and their esoteric teachings.\n\nUnderstanding this Trīka philosophy and choice are what defines one’s own Self.\nEsoteric Trīka Mārga/path encourages Self discovery above all else.\n\nWe are deeply devoted to Trika philosophical insights with common interests often including:\n\nLinguistic Sanskṛt poems;\nBrutal Non-dual Bhairvāgamic Siddhānta-s;\nScience of Tantrāloka;\nLaw of Thoughtlessness;\nYoga of Śiva Sutras;\n112 VBT Dhāranā-s;\nDharma;\nMā Kāli;\nFrom Darkness to Light;\nDevotion;\nSādhanā;\nSamādhi\nMetaphysics;\nEsoteric Planes of Existence;\nand Mystikism.\n\nfeel free to explore\n\nPratyabhijñā System\nKula System\nKrama System\nSpanda System\nand more\n"},"test":{"title":"test","links":["first-page","second-page","third-page","ganapati","tags/introduction"],"tags":["introduction"],"content":"First heading\nThis is a sample document.\nIndex.md is a first page which is our homepage.\n\n\n                  \n                  INFO\n                  \n                \n\nPress Ctrl + - to zoom out and see full site\n\n\nWe can add other things at later\nthats second heading with two hashes\nThen, in your terminal of choice, enter the following commands line by line:\necho &quot;Welcome to Tantra loka&quot;\nthis is how you add code\nThis could be our index or so\nthis is how we link another pages no matter where they located at but they should have accurate file name\n[[first page]]\n[[second page]]\n[[third page]]\n\n\nfirst page\nsecond page\nthird page\n\nganapati\nThis is how we add external link\nVideo Link\n[Video Link](www.youtube.com/watch)\n\nalso images can be added via adding full url of it like above or uploading image file in some folder and giving path like this\n![image alt text](/images/shiva.jpg)\n\n\nlists\n\nfirst thing\nsecond thing\nthird thing\n\nhasttags\nHashtags works like wonders here.\nThey can be use to categories various pages.\nlike thisintroduction\nnow this page will be listed under introduction tag\nMore info and configuration can be found in here\nquartz.jzhao.xyz/"}}